### ■ 예제149. 파이썬과 mySQL 연동
#### 이미지를 숫자로 변환해서 Oracle 또는 mySQL에 저장하는데 오라클은 비싸서 이미지와 같은 빅데이터는 주로 mySQL에 저장

### ※ 문제293. 직업이 salesman인 사원들의 이름과 월급과 직업을 출력하시오

```mysql
select ename, sal, job
    from emp
    where job='SALESMAN';
    ```

시퀄서버 -------> MSSQL
```
    * 현업에서 많이 사용하는 데이터베이스
1. Oracle        -> 중요한 데이터
2. MySQL         -> 상대적으로 덜 중요한 데이터(빅데이터 로그성, 이미지 등)
3. MSSQL         -> 게임회사?
```
3가지 전부를 파이썬과 연동할 줄 알아야 함
```
MySQL 접속 할 때마다 use db명 을 해야한다
```

### ※ 문제294. 직업, 직업별 토탈월급을 출력하는데 직업별 토탈월급이 4000 이상인 것 만 출력하고 직업별 토탈월급이 높은 것부터 출력

```mysql
select job, sum(sal)
    from emp
    group by job
    having sum(sal)>=4000
    order by 2 desc;
    ```

### ■ Oracle과 MySQL의 함수 비교
```
        (Oracle)             (MySQL)
    1.   nvl                 ifnull    
    2.   sysdate             sysdate()
    3.   months_between      period_add
    4.   last_day            last_day
    5.   decode              if
    6.   case                case
    7.   rollup              with rollup
    8.   listagg             group_concat
    ```

### ※ 문제295. 이름, 커미션을 출력하는데 커미션이 null인 사람들은 0으로 출력하시오

```mysql
select ename, ifnull(comm, 0)
	from emp;
    ```

### ※ 문제296. 오늘 날짜를 출력하시오

```mysql
select sysdate();
    ```

### ※ 문제297. 부서번호, 부서번호별 토탈월급을 출력하는데 맨 아래쪽에 전체 토탈월급을 출력하시오

```mysql
select deptno, sum(sal)
    from emp
    group by deptno with rollup
    ```

### ※ 문제298. scott의 월급을 0로 변경하시오

```mysql
update emp set sal=3000 where ename='scott';
```

### ※ 문제299. 오라클의 도스창같은 mysql command창에서도 autocommit 옵션을 확인하고 해제하시오

```mysql
mysql> select @@autocommit;
+--------------+
| @@autocommit |
+--------------+
|            1 |
+--------------+
1 row in set (0.00 sec)

mysql> set autocommit=false;
Query OK, 0 rows affected (0.00 sec)

mysql> select @@autocommit;
+--------------+
| @@autocommit |
+--------------+
|            0 |
+--------------+
1 row in set (0.00 sec)

```
#### 창을 새롭게 열면 다시 autocommit이 활성화 되어있음

### ※ 문제300. 오라클의 listagg 함수와 같은 group_concat을 사용해서 부서번호, 부서번호별로 속한 사원들의 이름을 가로로 출력하시오

```mysql
select deptno, group_concat(ename separator ',')
	from emp
    group by deptno;
    ```

### ※ MySQL과 MSSQL에서 DML 작업을 할 때는 Oracle과 다르게 autocommit 기능이 기본적으로 활성화 되어져있으니 반드시 주의해야 한다

### ※ 문제301. 파이썬과 MySQL을 서로 연동하시오

In [2]:
import pymysql

# MySQL Connection 연결
conn = pymysql.connect(host='localhost', user='root', password='Adrian30s!', db='orcl', charset='utf8')

# Connection 으로부터 Cursor 생성
curs = conn.cursor()

# SQL문 실행
sql = "select * from emp"
curs.execute(sql)

# 데이타 Fetch
rows = curs.fetchall()
    # 전체 rows

for i in rows:
    print (i)

# Connection 닫기
conn.close()

(7839, 'KING', 'PRESIDENT', None, datetime.date(1981, 11, 17), 5000, None, 10)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.date(1981, 5, 1), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.date(1981, 5, 9), 2450, None, 10)
(7566, 'JONES', 'MANAGER', 7839, datetime.date(1981, 4, 1), 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(1981, 9, 10), 1250, 1400, 30)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.date(1981, 8, 21), 1500, 0, 30)
(7900, 'JAMES', 'CLERK', 7698, datetime.date(1981, 12, 11), 950, None, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.date(1981, 2, 23), 1250, 500, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.date(1981, 12, 11), 3000, None, 20)
(7369, 'SMITH', 'CLERK', 7902, datetime.date(1980, 12, 9), 800, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.date(1982, 12, 22), 0, None, 20)
(7876, 'ADAMS', 'CLERK', 7788, datetime.date(1983, 1, 15), 1100, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.date(1982, 1, 11), 1300, None, 10)

### ※ 문제302. 연동한 emp 데이터를 판다스 데이터프레임으로 변환해서 이름, 월급을 출력하시오

In [6]:
import pymysql,pandas as pd
conn = pymysql.connect(host="localhost", user="root",password="",
                       db="orcl",charset="utf8")
curs = conn.cursor()

sql = "select ename,sal from emp"
curs.execute(sql)

rows = curs.fetchall()
colname = curs.description
print(colname)

col = []
for i in colname:
    col.append(i[0].upper())
emp = pd.DataFrame(list(rows),columns=col)
emp

(('ename', 253, None, 10, 10, 0, True), ('sal', 3, None, 7, 7, 0, True))

     ENAME   SAL
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5   TURNER  1500
6    JAMES   950
7     WARD  1250
8     FORD  3000
9    SMITH   800
10   SCOTT     0
11   ADAMS  1100
12  MILLER  1300

In [4]:
import pymysql
import pandas as pd
conn = pymysql.connect(host='localhost', user='root',\
                       password='', db='orcl', charset='utf8')
curs = conn.cursor()

sql = "select ename,sal from emp"
curs.execute(sql)

rows = curs.fetchall()
emp = pd.DataFrame(list(rows))
emp

         0     1
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5   TURNER  1500
6    JAMES   950
7     WARD  1250
8     FORD  3000
9    SMITH   800
10   SCOTT     0
11   ADAMS  1100
12  MILLER  1300

### ※ 문제303. import oracle이라고 해서 편하게 오카르과 연동했던 것처럼 import mysql이라고 해서 사용할 수 있도록 모듈화 시키시오

In [1]:
from my_loc import mysql

emp=mysql.mysql('emp')
emp[['ename','sal']]

     ename   sal
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5   TURNER  1500
6    JAMES   950
7     WARD  1250
8     FORD  3000
9    SMITH   800
10   SCOTT     0
11   ADAMS  1100
12  MILLER  1300